codes/Lgyf9Ues.XML

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="http://www.alfresco.org/ws/service/repository/1.0" xmlns:ns1="http://www.alfresco.org/ws/model/content/1.0">
   <soapenv:Header>
      <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" soapenv:mustUnderstand="1">
         <wsu:Timestamp
            xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
            <wsu:Created>2018-01-30T23:54:15.985Z</wsu:Created>
            <wsu:Expires>2018-01-31T01:52:36.221Z</wsu:Expires>
         </wsu:Timestamp>
         <wsse:UsernameToken>
            <wsse:Username>admin</wsse:Username>
            <wsse:Password
               Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">admin</wsse:Password>
         </wsse:UsernameToken>
      </wsse:Security>
   </soapenv:Header>
   <soapenv:Body>
      <ns:get>
         <ns:where>
            <!--You have a CHOICE of the next 2 items at this level-->
            <!--Zero or more repetitions:-->
            <ns1:nodes>
               <!--Optional:-->
               <ns1:store>
                  <!--Optional:-->
                  <ns1:scheme></ns1:scheme>
                  <!--Optional:-->
                  <ns1:address></ns1:address>
               </ns1:store>
               <!--Optional:-->
               <ns1:uuid>a1ca60c1-be30-4fcf-a212-b395ed4dd423</ns1:uuid>
               <!--Optional:-->
               <ns1:path>/</ns1:path>
            </ns1:nodes>
            <ns1:query>
               <ns1:language></ns1:language>
               <ns1:statement></ns1:statement>
            </ns1:query>
         </ns:where>
      </ns:get>
   </soapenv:Body>
</soapenv:Envelope>